{"0":["I managed to snag this during the flash sale for $1. A very good deal for its specs and free delivery\n\nItem was advertised as 56K Ohm resistor and unfortunately,  I do not have the equipment to verify that but it should work well with all your USB-C devices.\n\n","Item received in good condition. Have yet to try out the cable as this is meant as a spare to the current ones that my family members and I are using. Thank seller for the promotion. Looking forward to more promotions in the near future.","bought three & all came in rly good condition! will definitely be back for more! #ShopeeHaul","Love my purchase! Item safely arrived and received in good condition. Item just as desription and as shown. Will definitely recommend item & seller store to others. Delivery doesnt take long, very satisfied with the product n service. Item is well packed too. Shall return for more.Thank you seller!","Saw TOPK 1M nylon Braide Gold Plate Plug Type C cable on flash sales going for $0.99. This is my 2nd purchase form the seller. It is definitely a great buy as it work with fast charging and quality of the item seem pretty good. Need to test in durability in time to come. Delivery of the item is fast","Saw TPOK 1M Nylon Braided Gold Plated Plug Type C during the flash sales. I bought without hesitation as it only cost one dollar. The product come in nice envelope and tested with it and working fine. The material feel good and durable. Time will determine on its durability. The colour is damn nice.","Item was shipped out the next day after purchase & received in a week thru standard economy.. Fast delivery considering its from overseas.. Value for money.. The cable works perfectly fine.. Excellent service by seller! ","Ordered the item on 09 september and recieved via normal mail on 16 september. Fast charing cable! ","The usb cable came with a cable organiser. Quite surprised by that as usually its cable tied and not cable organiser with velcro. Definitely worth it. Able to fast charge my S10 Plus. ","Fast charging cable really works, package says AUX but is just a normal cable. Am very impressed by the quality for the price paid so hopefully this lasts a long time.","Very good quality and with gold plated connectors.\nThe nylon braided cable also looks strong and durable. At this price $1 flash sale, it is a no brainer to buy!","Item arrived intact and well packed. The items are as described on seller's website. Good quality braided wire with durable enhancement on both ends. "]}
