{"apple-iphone-11":{"cons":[["Cameras lack optical zoom, Some may not like the thicker bezels, Comes with a 5-watt charger","No big increases in wireless performance. Next year's iPhone will likely mark a major change.","Only Pro models get the 2x telephoto. The ultrawide-angle camera doesn’t add Night Mode. No USB-C port. The Pro phones have a faster 18-watt charger but iPhone 11 doesn't. Still has a good (but not OLED) display.","no expandable storage, weak location accuracy, moderate audio performance, weak power supply, only 12 months warranty, restricted NFC","Starting storage of 64GB","No OLED display, Bezels are still large, No zoom lens","iOS 13 is buggy, Just one fairly large size, Get out of here with this 5W charger, The garden is beautiful, but the walls grow ever higher","The battery life and display aren't as nice as the Pro. It definitely feels cheaper.","No zoom lens on camera, LCD screen not as good as OLED for movies, Only comes with 5W charger"]],"pros":[["Impressive speed, New wide and ultra wide cameras, Elegant design that doesn't make sacrifices for a lower price","Reasonable price. New wide-angle camera option. Fastest processor available. Accurate display colors.","Even faster speed, improved battery life. The iPhone 11's cameras get an excellent new Night Mode and an ultrawide-angle camera that can add extra detail in photos. Fantastic video camera.","powerful SoC, bright and colour accurate LCD panel, dust and waterproof, wide LTE frequency support, wireless charging, good battery life","Fast performance, New camera features, Strong battery life","Tougher and water resistant design, glossy back., The screen has excellent brightness and contrast., Apple A13 Bionic is the fastest smartphone chip on the planet., Excellent battery life, fast charging support., Stereo speakers with great quality., iOS provides smooth user experience.","New colours are great, Ultra wide angle camera is great, Decent price","Excellent camera, Terrific battery life, Lower price","Slofies, dramatic ultra-wide angle photos, Night mode, and outstanding dynamic range.","Superb dual-lens camera, Blazingly fast, Great battery life, Lovely design and build, Impressive audio"]]},"hp-stream-14-z0xx-series-notebook-pc":{"cons":[["Glossy display, Only 12 months warranty, A matte display and longer battery life."," Reflective screen, Only 12 months warranty"]],"pros":[["Slim, nice case, Silent operation, Decent keyboard, The slim case."," Sleek, responsive case, silent operation, ordinary keyboard"]]}}
