[{"product_name": "sony-srs-xb31", "url": "https://www.testfreaks.com/pc-speakers/sony-srs-xb31/\n", "review": [["The SRS-XB31 certainly lived up to the hype it first gave us during our initial hands-on. It truly is a premium looking rugged speakers with amazing overall audio quality, solid structure, and superb battery life.", "When you’re choosing speakers, you generally want to go as large as possible. Bigger speaker designs are capable of housing larger drivers, and more of them. One consequence of that is you often can experience fairly steady improvements in sound quality as the physical size of speakers are...", "Looking at Sony's recent additions to the Extra Bass line of portable speakers, the XB31 seems to offer you the best bang for buck as it seems to objectively be the best sounding whilst still giving you nearly all of the features of the XB41", "The Sony SRS-XB31 is a portable Bluetooth speaker that doesn’t really break through any boundaries for the category as a whole, but it doesn’t break the bank either.", "You’d need pretty big pockets if you wanted to carry Sony’s SRS-XB31 around, but fortunately if you did, you could really claim it was a party in your pocket, because that’s what’s on offer here.", "The Sony SRS-XB31 is a fun speaker in every sense of the word with excellent audio quality and a light show that stands it apart from the competition.", "For its middle class, since there are smaller ones (like the XB21 itself), it's really one of the best. It's not the cheapest, but it brings Sony's audio tradition along with it. I had really liked the XB30 and the Extra Bass, and the least I can say is that Sony has maintained the quality that I ...", "The SRS-XB31 is one of the speakers I really like, and the price is not completely stupid. But if you are looking for a cool party speaker, JBL Pulse 3 is a much better bet, and if you want good sound, there are many other speakers that sound significantly better.", "Sony SRSXB31 is a high-end speaker that is simply presented as a portable alternative with NFC and Bluetooth connectivity. Inside, it not only promises great sound quality, but also long autonomy, resistance to all kinds of ...", "Sony has launched a very successful speaker with the SRS-XB31. Certainly for everyone who likes a speaker with big bass. Close your eyes and you would swear that the XB31 is twice as big. Other styles of music also sound good, although the sound may then become somewhat dull.", "Compared to its predecessor, the XB31 has been gifted with a nicer exterior and is now waterproof but functionally less has happened. It still sounds really good and party lights are an odd feature that is appreciated."]], "pros": [["Premium build, Water and Dust resistance, Amazing audio quality, Long battery life, Power bank feature, Wireless Party Chain", "Balanced sound, Feature-rich, Appealing design, Mobile app to extend functionality", "Solid bass, Good price", "Loud, Water resistant, Lots of battery life, Charges over microUSB, Includes flashy lights made for parties, Virtual instruments are a neat, weird feature, Good value", "Puts in a light show, Sleek design, Excellent audio, Lots of control within the app, Waterproof", " Portable Charger, Built-in Lights, Extra Bass and Live Sound Functions are very effective, High Volume, Balanced Sound", " Design with play of lights, Water resistance and dust accumulation, Great battery autonomy, NFC connectivity in addition to Bluetooth, Various colors available", " Compact, Waterproof up to IP67, Tasty bass, LED lighting", " The sound., The app with associated setting options., The light effects are a fun extra feature., Battery life."]], "cons": [["A bit expensive", "Deeper bass extension would be appreciated, Some features are rather gimicky, No included storage/carrying pouch", "Minimal smarts, Clunky app", "Flashy lights aren't always (or remotely) in sync, Virtual instruments will never be used, Bass can be a bit heavy", "Sound cuts out occasionally, but not often", " It takes time to charge, Battery runs out fast with lights, App is confusing", " Nothing to mention", " Sound sometimes sounds somewhat dull", " The \"Party Booster\" feature. The treble could have been more open and clean., Right now more expensive than its predecessor."]]}, {"product_name": "jbl-flip4", "url": "https://www.testfreaks.com/pc-speakers/jbl-flip4/\n", "review": [["A nice upgrade over its predecessor, the Flip 4 is one of the best speakers in its size and price class.", "JBL’s Boombox can fuel a party for days on end.", "After we’ve tested the Flip 4 Bluetooth Speaker from JBL, we can definitely say that it gives off impressive quality sounds with big and full bass, plus crystal-clear vocals. Not only that, but the other great thing about the speaker is that it’s now waterproof, so you won’t have to worry about...", "If you're looking for a speaker that's less than $100 to bring to the beach or pool, the Flip 4 is a great option.", "The JBL Flip 4 improves on an already-solid speaker line, adding more battery life, more ruggedness and better sound.", "JBL is back with a new speaker in the Flip series which otherwise looks nearly the same as the previous generations, but has improved functionality. It is actually heavier than its predecessor weighing around 517g, all wrapped under a more durable fabric with a tighter knit.", "The JBL Flip 4 speaker delivers strong Bluetooth audio from its modest, waterproof frame.", "The Flip 4 continues to carry on JBL's Flip series tradition with a great sounding and user friendly compact speaker design. We found it to be our favorite simply because it has done a great job of balancing portability, features, and performance.", "If you liked the JBL flip 3, then it stands to reason that you will like the Flip 4 as well. Although the two are not compatible with each other, the JBL Flip 4 takes most of the design points and features from the Flip range and improves on them. Most notably, with its waterproof nature.", "If you’re on the market for a high-quality Bluetooth speaker, the JBL Flip 4 is a great starting point. While many speakers promote themselves on one specific feature, the Flip 4 is respectable in almost every regard. It’s very durable, has a long battery life, and easy to use.", "It’s summertime again, and that means pool parties, camping, canoe trips, picnics, and barbecues. But what’s a great summer get-together without a killer soundtrack? There’s just one problem… how are you going to get everyone to actually hear that bangin’ playlist you spent all day making?", "The JBL Flip 4 is our favorite budget-tier bluetooth speaker. Sounds great, very portable, durable, and easy to use.", "JBL’s life-proof Flip 4 is durable, affordable, and perfect for all kinds of outdoor excursions.", "The JBL Flip 4 is a robust, affordable Bluetooth speaker, and one that’s comfortably supplying sounds to all elements of your life. While the speaker might be punchy, deficiencies in the mid-range stop it being an instant must-buy.", "The Flip 4 is a mighty performer given its tiny size, and is another solid option in the sub-Rs. 10,000 segment. Its sound isn't perfect, as the mid-range isn't distinct enough, and vocals can be overpowering. However, it does deliver good bass, provided you keep the volume level under 90 percent.", "The JBL Flip 4 at Rs 9,999 remains one of the most attractive options for buyers shopping for wireless speakers at under Rs 10,000. It has a popular sonic signature, great styling and is very resistant to water, all of which make it a strong option.", "The JBL Flip 4 is a more mature product, offering better balanced sound than its predecessor, the Flip 3. However, its bass delivery is still a bit weak, and it is here that the UE Wonderboom plays better. Nevertheless, the JBL Flip 4 offers great clarity, and the sound signature is sweet and warm.", "If you're looking for a decent, relatively affordable speaker that you can throw in your bag, take to the beach, in your bathroom, or wherever, the Flip 4 is convenient.", "You’re very unlikely to do better for the price for a compact, portable Bluetooth speaker than the JBL Flip 4.", "If you want more battery life or bass, there are other options in the company’s stable for you. However, if you want the best mix of good sound, design, durability and price, the JBL Flip 4 is well worth tuning yourself towards."]], "pros": [["The JBL Flip 4 offers significant improvements over the Flip 3, including better sound and battery life, as well as full waterproofing. It has speakerphone capabilities and a more durable fabric covering.", "Bombastic bass response, Good outdoor performance, Waterproof, Charges two devices at once, 24-hour battery life", "Good sound, Waterproof", "Excellent bass, treble and midtones for a small speaker, Good battery life, Waterproof", "Solid audio performance with rich bass and well-defined highs. Can be submerged in shallow water.", "Great sound quality for this size of speaker, Compact, portable, and rugged, Water resistant down to 1 meter, Affordable price point, Can pair with up to 100 other Flip 4s", "Take it anywhere, Durable, waterproof shell, Powerful bass response, Good battery life, Cool connectivity features", "Decent, rugged design, Reasonable price tag, Plenty of bass", "Compact and rugged, IPX7 waterproofing, Warm sound with good bass, Good battery life", "Impressive clarity, Sweet, warm audio, Fully waterproof, Very well built, Allows multi-speaker setup", "Good value for money, Attractive colourful design, Waterproof and very portable", "Excellent sound, safe around water, deep, deep bass"]], "cons": [["Its bass is improved but it still lacks some real bass punch.", "A little heavy for backpacking or camping, Poor clarity in treble register, Limited EQ control", "JBL Connect+ not backwards compatible, Battery life on max volume only 4 hours", "Distorts at high volumes, Limited functionality in app", "No track navigation buttons. Audio cable not included.", "Only omni-directional sound, No dedicated track management buttons", "Middling clarity in upper register, Doesn’t play well with other speakers (yet)", "Underwhelming mid-range sound, Slightly basic looks, Boring colour options", "Exposed radiators, Mid-range suffers a bit", "Distinct lack of bass, Heavier than before, Slightly more expensive than competition", "Getting to ports can be tricky, Sound balance isn't great at high volumes", "Hmmm"]]}, {"product_name": "hp-stream-14-z0xx-series-notebook-pc", "url": "https://www.testfreaks.com/laptops/hp-stream-14-z0xx-series-notebook-pc/\n", "review": [["All things considered, we liked the HP Stream 14-z050ng. Practically, you'll get a Windows-based Chromebook , which can run \"normal\" Windows applications, too. The processing performance is sufficient for office, Internet and video playback.", "All in all, the HP Stream 14-z050ng really enjoys it. You get with the computer, so to speak, a Windows-based Chromebook, which is also able to run \"normal\" Windows applications.", "Hard to put more than three stars in this Stream 14. It is saved by its look, its satisfactory keyboard and of course its price of 300 euros. It is a good device to surf or work in any room of the house or listen to some music using the four small ...", "The HP Stream 14-z002na turned out to be a very interesting budget option that can compete with tablets and Chromebooks. It has a compact, cheerful design, with a metal case, which was not at all expected from an inexpensive laptop.", "Windows Chromebook.", "Chromebook with Windows sauce. HP is trying to compete with Google's Chromebooks with a new 14-inch notebook under Windows. An accelerated AMD APU processor makes the whole thing work. The concept looks promising, but what about in practice?"]], "pros": [["Slim, nice case, Silent operation, Decent keyboard, The slim case.", " Sleek, responsive case, silent operation, ordinary keyboard"]], "cons": [["Glossy display, Only 12 months warranty, A matte display and longer battery life.", " Reflective screen, Only 12 months warranty"]]}, {"product_name": "apple-iphone-11", "url": "https://www.testfreaks.com/cellphones/apple-iphone-11/\n", "review": [["Apple had a winner with the iPhone XR, and while its follow up doesn’t have to rewrite the book on mobile phones, it needs to do enough to be a worthy heir to the throne. The new iPhone 11 is up to the task, with compelling changes to the camera that will have even users of the year-old iPhone XR...", "The iPhone 11 offers solid camera performance and power to spare for a relatively reasonable price. It isn't exciting, but it's a good replacement for older iPhones.", "Apple may have skipped flashy extras on this year's phones, but the iPhone 11 is the best midtier model the company's ever made.", "Apple has repeated its approach from 2018 for the September iPhone refresh, and just like last year there are three models. Apple's iPhone 11 has much of what makes the iPhone 11 Pro great for less than what the iPhone XR cost, and is very clearly the device that Apple wants people to buy.", "A week after using the iPhone 11, I've concluded it is my ideal phone. It's affordable in today's market, where $1,000 phones reign supreme. It's a perfect size. It's fast. It has an ultra-wide-angle camera and another camera that can capture stunning photos at night.", "Apple iPhone 11 review: At Rs 64,900 in India, the iPhone 11 is way cheaper than what iPhone XR was when it launched. Here is our review of the new iPhone 11 and how it performs, especially in the camera department.", "The Apple Event 2019 brought three new iPhones and a new naming scheme. As before, there is a more affordable iPhone, the main flagship and a larger Max variant. But what distinguishes the individual models, exactly? Let's take a closer look.", "The iPhone 11 is cheaper, but not cheap. It costs as much as many of the current Android flagships. But in the Appleverse, it is the one you get if you are on the budget. And the maker made sure you will want to get it.", "Today, the Apple iPhone 11 series are now available in Malaysia and it's that time of the year again on which telco plan is the best one for you. Well, we have round up the four telcos - Celcom , Digi , Maxis and U Mobile so without further ado, check out what they have to offer below!", "Apple's cheap iPhone is even cheaper than ever, and it comes with most of the iPhone 11 Pro's coolest features. So, what are the tradeoffs?", "This is the iPhone for the average Apple smartphone user", "The iPhone 11 gets you every important iPhone 11 Pro feature, like an ultra wide camera, for hundreds less.", "The iPhone 11 costs Rs 64,900 (64GB), Rs 69,900 (128GB) and Rs 79,900 (256GB), along with offers on Amazon and Flipkart bringing down prices further.", "If I can move from Apple’s most powerful 2018 handset to the iPhone 11 and be happy, I believe anyone will be thrilled at upgrading from an iPhone 7, 7 Plus, or anything older.", "This is one of the simplest reviews I’ve ever had to write: the iPhone 11 is the phone most people who are upgrading to a new iPhone this year should get. It’s an excellent phone, with one of the best cameras I’ve ever seen on a smartphone and terrific battery life.", "Apple iPhone 11 is the latest smartphone from Apple launched in September 2019. The device is the direct successor of last year’s iPhone XS , and come with updates specifications and features in almost similar body aesthetics with the iPhone XR .", "It's so close in capabilities to the iPhone 11 Pro that only display, camera, and radio nerds may really notice any day-to-day differences. And, for exactly those nerds, I'll also be posting a much deeper, more detailed review of the iPhone 11 Pro and iPhone 11 Pro Max , so be sure to check that...", "The iPhone 11 strikes a brilliant balance between features and price. You wouldn't know it's the cheaper of Apple's 2019 phones from its build, camera and speed. If only it had an OLED screen…"]], "pros": [["Impressive speed, New wide and ultra wide cameras, Elegant design that doesn't make sacrifices for a lower price", "Reasonable price. New wide-angle camera option. Fastest processor available. Accurate display colors.", "Even faster speed, improved battery life. The iPhone 11's cameras get an excellent new Night Mode and an ultrawide-angle camera that can add extra detail in photos. Fantastic video camera.", "powerful SoC, bright and colour accurate LCD panel, dust and waterproof, wide LTE frequency support, wireless charging, good battery life", "Fast performance, New camera features, Strong battery life", "Tougher and water resistant design, glossy back., The screen has excellent brightness and contrast., Apple A13 Bionic is the fastest smartphone chip on the planet., Excellent battery life, fast charging support., Stereo speakers with great quality., iOS provides smooth user experience.", "New colours are great, Ultra wide angle camera is great, Decent price", "Excellent camera, Terrific battery life, Lower price", "Slofies, dramatic ultra-wide angle photos, Night mode, and outstanding dynamic range.", "Superb dual-lens camera, Blazingly fast, Great battery life, Lovely design and build, Impressive audio"]], "cons": [["Cameras lack optical zoom, Some may not like the thicker bezels, Comes with a 5-watt charger", "No big increases in wireless performance. Next year's iPhone will likely mark a major change.", "Only Pro models get the 2x telephoto. The ultrawide-angle camera doesn’t add Night Mode. No USB-C port. The Pro phones have a faster 18-watt charger but iPhone 11 doesn't. Still has a good (but not OLED) display.", "no expandable storage, weak location accuracy, moderate audio performance, weak power supply, only 12 months warranty, restricted NFC", "Starting storage of 64GB", "No OLED display, Bezels are still large, No zoom lens", "iOS 13 is buggy, Just one fairly large size, Get out of here with this 5W charger, The garden is beautiful, but the walls grow ever higher", "The battery life and display aren't as nice as the Pro. It definitely feels cheaper.", "No zoom lens on camera, LCD screen not as good as OLED for movies, Only comes with 5W charger"]]}]